project/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяАлгоритмКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииСвойств/Forms/ФормаГруппы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ТипКонвертации, Код, Ссылка, Захвачен");
	Если НЕ ЗначениеЗаполнено(ДанныеВладельца.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сначала следует записать правило конвертации объекта.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЭтоКонвертацияXDTO = (ДанныеВладельца.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	КодПКО = ДанныеВладельца.Код;
	ЗаполнитьТаблицыСвойств();
	Захвачен = ДанныеВладельца.Захвачен;
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Захвачен = Истина;
		ИначеЕсли Захвачен И ЗначениеЗаполнено(Объект.Владелец) Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма, Объект.Владелец);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			СписокКонвертаций = Новый СписокЗначений;
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Владелец, СписокКонвертаций);
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьСпискиВыбораСвойств();
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурацииСтрокой) Тогда
		УказыватьСвойстваСтрокой = Истина;
		УказыватьСвойстваСтрокойПриИзменении(Элементы.УказыватьСвойстваСтрокой);
	КонецЕсли;
	УстановитьДоступность();
	УстановитьВидимость();
	ЗаполнитьИменаОбработчиков();
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СвойствоФорматаОчистка(Элемент, СтандартнаяОбработка)
	Объект.СвойствоФормата = "";
	Объект.ТипСвойстваФормата = "";
КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииОчистка(Элемент, СтандартнаяОбработка)
	Объект[Элемент.Имя] = "";
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		Объект.ТипСвойстваКонфигурации = "";
	Иначе
		Объект.ТипСвойстваКонфигурацииКорреспондента = "";
	КонецЕсли;
	ЗаполнитьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Текст = "" Тогда
		СвойствоКонфигурацииОчистка(Элемент, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Текст = "" Тогда
		Объект.СвойствоФормата = "";
		Объект.ТипСвойстваФормата = "";
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект[Элемент.Имя] = ВыбранноеЗначение.Ссылка;
	Иначе
		Объект[Элемент.Имя] = ВыбранноеЗначение;
	КонецЕсли;
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		Объект.ТипСвойстваКонфигурации = ОпределитьТипСвойства(ТаблицаСвойствКонфигурации, Объект.СвойствоКонфигурации);
	Иначе
		Объект.ТипСвойстваКонфигурацииКорреспондента = ОпределитьТипСвойства(ТаблицаСвойствКонфигурацииКорреспондент, Объект.СвойствоКонфигурацииКорреспондента);
	КонецЕсли;
	ЗаполнитьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.СвойствоФормата = ВыбранноеЗначение;
	Объект.ТипСвойстваФормата = ОпределитьТипСвойства(ТаблицаСвойствФормата, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьСвойстваСтрокойПриИзменении(Элемент)
	Если УказыватьСвойстваСтрокой Тогда
		ТекСтраница = Элементы.СтраницаСопоставлениеСвойствВручную;
	Иначе
		ТекСтраница = Элементы.СтраницаСопоставлениеСвойствВыбор;
	КонецЕсли;
	
	Элементы.СтраницыСопоставлениеСвойств.ТекущаяСтраница = ТекСтраница;
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("ТаблицаСвойствФормата, ТекущаяСтрока, РежимРаботы", 
					ТаблицаСвойствФормата, Объект.ПолноеИмяСвойстваФормата, "СвойствоФормата");
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбраноСвойствоФормата", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура СвойствоКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбраноСвойствоКонфигурации", ЭтотОбъект, Элемент.Имя);
	ПараметрыФормыВыбора = Новый Структура("РежимРаботы", "СвойствоКонфигурации");
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствКонфигурации);
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.СвойствоКонфигурации);
	Иначе
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствКонфигурацииКорреспондент);
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.СвойствоКонфигурацииКорреспондента);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзВходящихДанныхПриИзменении(Элемент)
	УстановитьДоступность();
	Если Объект.ПолучитьИзВходящихДанных Тогда
		Объект.ТипСвойстваКонфигурации = "";
		Объект.СвойствоКонфигурации = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицыСвойств()
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец, 
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Истина, ""));
	Если ЭтоКонвертацияXDTO Тогда
		ФильтрСвойствФормата = Новый Структура("ОбъектФормата, ЭтоГруппа, Родитель",  ДанныеПКО.ОбъектФормата, Истина, "");
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(ТаблицаСвойствФормата,
				Объект.Владелец,
				ФильтрСвойствФормата);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурацииКорреспондент,
			Объект.Владелец, 
			ДанныеПКО.ОбъектКонфигурацииКорреспондент,
			Новый Структура("ЭтоГруппа, Родитель, Корреспондент", Истина, "", Истина));

	КонецЕсли;
КонецПроцедуры
		
&НаКлиенте
Процедура НастроитьСпискиВыбораСвойств()
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоКонфигурации, ТаблицаСвойствКонфигурации, Истина);
	Если ЭтоКонвертацияXDTO Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоФормата, ТаблицаСвойствФормата, Истина);
	Иначе
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоКонфигурацииКорреспондента, ТаблицаСвойствКонфигурацииКорреспондент, Истина);
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры


&НаКлиенте
Процедура ВыбраноСвойствоФормата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Объект.ПолноеИмяСвойстваФормата = РезультатЗакрытия;
	СвойствоФорматаОбработкаВыбора(Элементы.СвойствоФормата, РезультатЗакрытия, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноСвойствоКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	СвойствоКонфигурацииОбработкаВыбора(Элементы[ДополнительныеПараметры], РезультатЗакрытия, Истина);
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТипСвойства(ТаблицаСвойств, ТекСвойство)
	Если ТипЗнч(ТекСвойство) = Тип("СправочникСсылка.Свойства") Тогда
		СтрокиТаблицыСвойств = ТаблицаСвойств.НайтиСтроки(Новый Структура("Ссылка", ТекСвойство));
	Иначе
		СтрокиТаблицыСвойств = ТаблицаСвойств.НайтиСтроки(Новый Структура("Имя", ТекСвойство));
	КонецЕсли;
	Если СтрокиТаблицыСвойств.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат СтрокиТаблицыСвойств[0].Тип;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.УказыватьСвойстваСтрокой.Видимость = ЭтоКонвертацияXDTO;
	Элементы.СвойствоКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.СвойствоФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ТипСвойстваФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ТипСвойстваКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПолучитьИзВходящихДанных.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Порядок.Видимость = НЕ ЭтоКонвертацияXDTO;

	Элементы.ГруппаXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ИспользуетсяАлгоритмКонвертации.Видимость = ЭтоКонвертацияXDTO;
	Если ЭтоКонвертацияXDTO Тогда
		Элементы.ГруппаXML.Высота = 1;
	КонецЕсли;
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Элементы.СвойствоКонфигурации.Заголовок = НСтр("ru='Источник'");
		Элементы.ТипСвойстваКонфигурации.Заголовок = НСтр("ru='Тип источника'");

	КонецЕсли;
	// Захват объекта.
	Если НЕ СовместнаяРабота Тогда
		Элементы.ДекорацияНуженЗахват.Видимость = Ложь;
		Элементы.ДекорацияЗахвачен.Видимость = Ложь; 
	Иначе
		Если НЕ Захвачен Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.ДекорацияЗахвачен.Видимость = Захвачен;
		Элементы.ДекорацияНуженЗахват.Видимость = НЕ Захвачен;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.СвойствоКонфигурации.Доступность = НЕ Объект.ПолучитьИзВходящихДанных;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИменаОбработчиков()
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурации) Тогда
		ИмяСвойства = Объект.СвойствоКонфигурации;
	Иначе
		ИмяСвойства = Объект.СвойствоКонфигурацииКорреспондента;
	КонецЕсли;
	НачалоИмени = "ПКГС_" + КодПКО + "_" + ИмяСвойства + "_";
	ДлинаКода = СтрДлина(КодПКО);
	КодПКС = СокрЛП(Формат(Объект.Код, "ЧГ=0"));
	КонецИмени = "_" + КодПКС + "_" + ДлинаКода;
	ИмяОбработчикаПередОбработкой = НачалоИмени + "ПередОбработкойВыгрузки" + КонецИмени;
	ИмяОбработчикаПередВыгрузкой = НачалоИмени + "ПередВыгрузкойСвойства" + КонецИмени;
	ИмяОбработчикаПриВыгрузке = НачалоИмени + "ПриВыгрузкеСвойства" + КонецИмени;
	ИмяОбработчикаПослеВыгрузки = НачалоИмени + "ПослеВыгрузкиСвойства" + КонецИмени;
	ИмяОбработчикаПослеОбработки = НачалоИмени + "ПослеОбработкиВыгрузки" + КонецИмени;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	Если ЭтоКонвертацияXDTO Тогда
		Возврат;
	КонецЕсли;
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(Элементы.СтраницыОбработчики, Объект);
КонецПроцедуры


#КонецОбласти
